In [1]:
import pandas
pandas.__version__

'1.0.1'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([400, 2000, 613, 116])
counts

0     400
1    2000
2     613
3     116
dtype: int64

In [4]:
counts.values

array([ 400, 2000,  613,  116], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
bacteria = pd.Series([400, 2000, 613, 116],
    index=['Firmicutes', 'Proteobacteria','Actinobacteria','Bacteroidetes'])
bacteria

Firmicutes         400
Proteobacteria    2000
Actinobacteria     613
Bacteroidetes      116
dtype: int64

In [7]:
bacteria['Actinobacteria']

613

In [8]:
bacteria['Firmicutes']

400

In [9]:
bacteria[0]

400

In [10]:
bacteria[2]

613

In [11]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firmicutes         400
Proteobacteria    2000
Actinobacteria     613
Bacteroidetes      116
Name: counts, dtype: int64

In [12]:
np.log(bacteria)

phylum
Firmicutes        5.991465
Proteobacteria    7.600902
Actinobacteria    6.418365
Bacteroidetes     4.753590
Name: counts, dtype: float64

In [13]:
bacteria[bacteria>1000]

phylum
Proteobacteria    2000
Name: counts, dtype: int64

In [14]:
bacteria_dict = {'Firmicutes':400,'Proteobacteria':2000,'Actinobacteria': 613,'Bacteroidetes':116}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 400, 'Proteobacteria': 2000, 'Actinobacteria': 613, 'Bacteroidetes': 116}

Firmicutes         400
Proteobacteria    2000
Actinobacteria     613
Bacteroidetes      116
dtype: int64

In [15]:
data = {"Province": ["FL","FL","NH","NH","ZH"],
        "Year": [2013,2014,2013,2014,2014],
        "Literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [16]:
df = pd.DataFrame(data,columns=["Year","Province","Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [17]:
df['nonsense'] = df.Year/df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [18]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2,3,4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [19]:
df["Serie_aligned"] = pd.Series(range(3), index=[0,1,2,])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000            0.0
1  2014       FL       0.1  20140.000000            1.0
2  2013       NH       0.5   4026.000000            2.0
3  2014       NH       0.3   6713.333333            NaN
4  2014       ZH       0.5   4028.000000            NaN

In [20]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Serie_aligned': {0: 0.0, 1: 1.0, 2: 2.0, 3: nan, 4: nan}}

In [21]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000            0.0
1  2014       FL       0.1  20140.000000            1.0
2  2013       NH       0.5   4026.000000            2.0
3  2014       NH       0.3   6713.333333            NaN
4  2014       ZH       0.5   4028.000000            NaN

In [22]:
data = [{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [23]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [24]:
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a   10   10
b   10   10
c   10   10

In [28]:
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a    6    6
b    6    6
c    6    6

In [29]:
ind = pd.Index([25,43,57,4,1,9])
ind

Int64Index([25, 43, 57, 4, 1, 9], dtype='int64')

In [30]:
ind[2]

57

In [31]:
ind[::]

Int64Index([25, 43, 57, 4, 1, 9], dtype='int64')

In [32]:
ind[0:2:5]

Int64Index([25], dtype='int64')

In [33]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [34]:
ind[3]=0

TypeError: Index does not support mutable operations

In [35]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [36]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0,10,25))
ser

0     8
1     5
2     5
3     7
4     0
5     7
6     5
7     6
8     1
9     7
10    0
11    4
12    9
13    7
14    5
15    3
16    6
17    8
18    2
19    1
20    1
21    0
22    5
23    2
24    2
dtype: int32

In [38]:
dfr = pd.DataFrame(rng.randint(0,10,(7,5)),
                   columns=['A','B','C','D','E'])
dfr

   A  B  C  D  E
0  7  2  0  0  7
1  6  4  4  3  7
2  5  6  0  9  0
3  4  8  6  3  2
4  7  4  2  2  9
5  3  3  4  3  5
6  3  0  0  6  1

In [39]:
np.exp(ser)

0     2980.957987
1      148.413159
2      148.413159
3     1096.633158
4        1.000000
5     1096.633158
6      148.413159
7      403.428793
8        2.718282
9     1096.633158
10       1.000000
11      54.598150
12    8103.083928
13    1096.633158
14     148.413159
15      20.085537
16     403.428793
17    2980.957987
18       7.389056
19       2.718282
20       2.718282
21       1.000000
22     148.413159
23       7.389056
24       7.389056
dtype: float64

In [40]:
np.sin(dfr*np.pi/4)

              A             B             C         D         E
0 -7.071068e-01  1.000000e+00  0.000000e+00  0.000000 -0.707107
1 -1.000000e+00  1.224647e-16  1.224647e-16  0.707107 -0.707107
2 -7.071068e-01 -1.000000e+00  0.000000e+00  0.707107  0.000000
3  1.224647e-16 -2.449294e-16 -1.000000e+00  0.707107  1.000000
4 -7.071068e-01  1.224647e-16  1.000000e+00  1.000000  0.707107
5  7.071068e-01  7.071068e-01  1.224647e-16  0.707107 -0.707107
6  7.071068e-01  0.000000e+00  0.000000e+00 -1.000000  0.707107

In [41]:
area = pd.Series({'Alaska': 1723337,'Texas':695662,
                   'California':423967}, name='area')
population = pd.Series({'California':38332521, 'Texas': 26448193,
                         'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [42]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [43]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [44]:
A = pd.Series([2, 4, 6], index=[0,1,2])
B = pd.Series([1, 3, 5], index=[1,2,3])
print(A)
print(B)
B
A + B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [45]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [46]:
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000            0.0
1  2014       FL       0.1  20140.000000            1.0
2  2013       NH       0.5   4026.000000            2.0
3  2014       NH       0.3   6713.333333            NaN
4  2014       ZH       0.5   4028.000000            NaN

In [47]:
df2 = pd.DataFrame({"Province":["FL","NH","ZH"],"Population":["100000","200000","300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [48]:
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000            0.0     100000
1  2014       FL       0.1  20140.000000            1.0     100000
2  2013       NH       0.5   4026.000000            2.0     200000
3  2014       NH       0.3   6713.333333            NaN     200000
4  2014       ZH       0.5   4028.000000            NaN     300000

In [50]:
df3 = pd.DataFrame({"Province":["FL","NH"],"Population":["100000","200000"]})
df3
df.merge(df3,right_on='Province',left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000            0.0     100000
1  2014       FL       0.1  20140.000000            1.0     100000
2  2013       NH       0.5   4026.000000            2.0     200000
3  2014       NH       0.3   6713.333333            NaN     200000

In [51]:
df4 = pd.DataFrame({"Province":["FL","NH","UT"],"Population":["100000","200000","500000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     200000
3  2014.0       NH       0.3   6713.333333            NaN     200000
4  2014.0       ZH       0.5   4028.000000            NaN        NaN
5     NaN       UT       NaN           NaN            NaN     500000

In [54]:
df5 = pd.DataFrame({"Province":["FL","NH","FL"],"Population":["100000","200000","50000"]})
print(df)
df.merge(df5,how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000            0.0
1  2014       FL       0.1  20140.000000            1.0
2  2013       NH       0.5   4026.000000            2.0
3  2014       NH       0.3   6713.333333            NaN
4  2014       ZH       0.5   4028.000000            NaN

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000            0.0     100000
1  2013       FL       0.2  10065.000000            0.0      50000
2  2014       FL       0.1  20140.000000            1.0     100000
3  2014       FL       0.1  20140.000000            1.0      50000
4  2013       NH       0.5   4026.000000            2.0     200000
5  2014       NH       0.3   6713.333333            NaN     200000
6  2014       ZH       0.5   4028.000000            NaN        NaN

In [55]:
serie_a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                      index=['f','e','d','c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                index=['f','e','d','c','b','a'])

In [56]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [57]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [59]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [60]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64